Revit 2026 API

# PointOnEdgeFaceIntersection Class

---

Define a ReferencePoint at the intersection of a referenceable edge or curve and a referenceable face.

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointOnEdgeFaceIntersection

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointOnEdgeFaceIntersection : PointElementReference
```
```vb
Public Class PointOnEdgeFaceIntersection
	Inherits PointElementReference
```
```cpp
public ref class PointOnEdgeFaceIntersection : public PointElementReference
```
```fsharp
type PointOnEdgeFaceIntersection =
    class
        inherit PointElementReference
    end
```

The PointOnEdgeFaceIntersection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OrientWithEdge | Whether to orient the ReferencePoint to the edge or the face. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEdgeReference | Get a copy of the edge or curve reference. |
|  | GetFaceReference | Get a copy of the face reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEdgeReference | Change the edge or curve reference. |
|  | SetFaceReference | Change the face reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The ReferencePoint's orientation is partially constrained either to the edge (in the manner of PointOnEdge) or to the face (in the manner of PointOnFace).

#### Reference

Autodesk.Revit.DB Namespace